{
  "meta": {
    "title": "Денис Киселёв -- Резюме",
    "description": ""
  },
  "cv-header": {
    "name": "Денис Киселёв"
  },
  "contacts": {
    "phone": "+7 916 942 1935",
    "phoneLabel": "Телефон"
  },
  "education": {
    "institution": "Московский Государственный Открытый Университет",
    "start-year": "2002",
    "finish-year": "2008",
    "degree": "",
    "specialization": "Управление и информатика в технических системах"
  },
  "areas-of-expertise": {
    "title": "КЛЮЧЕВЫЕ НАВЫКИ"
  },
  "experience": {
    "title": "Опыт работы",
    "jobs": [
      {
        "position": "Старший программист",
        "company": "PosiTrace (Global Fleet Management)",
        "start-year": "2024",
        "start-month": "Январь",
        "finish-year": "2024",
        "finish-month": "Июнь",
        "responsibilities": [
          "Разработка платформы для отслеживания транспортных средств, включающей улучшение производительности и добавление новых функций.",
          "Работа с легаси-кодом: оптимизация и рефакторинг для улучшения читаемости и поддерживаемости.",
          "Исправление и актуализация старых тестов, обеспечение их соответствия современным стандартам качества.",
          "Реализация интеграции со сторонними системами, такими как Apollo, HubSpot и QuickBooks, для расширения функциональности платформы.",
          "Сотрудничество с командой для выявления и решения технических проблем, а также для внедрения новых идей и подходов."
        ]
      },
      {
        "position": "Старший программист",
        "company": "Учи.ру (Uchi.ru)",
        "start-year": "2022",
        "start-month": "Август",
        "finish-year": "2024",
        "finish-month": "Январь",
        "responsibilities": [
          "Участвовал в разработке платформы для онлайн-образования в составе продуктовой команды.",
          "Оптимизировал и дорабатывал функционал существующих микросервисов, что способствовало повышению производительности и надежности системы.",
          "Переносил легаси-функционал в новые микросервисы, обеспечивая их совместимость с современными стандартами разработки.",
          "Переработал сервис миграции классов и приглашений учителей и учеников, улучшив процессы интеграции и взаимодействия пользователей.",
          "Доработал кабинет учителя в рамках бонусной программы для старшей школы, добавив новые функции и улучшив пользовательский интерфейс."        ]
      },
      {
        "position": "Ведущий программист",
        "company": "Люксофт",
        "start-year": "2021",
        "start-month": "Июнь",
        "finish-year": "2022",
        "finish-month": "Май",
        "responsibilities": [
          "Разработка платформы для совместной разработки, аналогичной продуктам Atlassian (Jira, Confluence).",
          "Платформа включала таск-трекер, хранение репозиториев кода, управление документацией, управление тестированием, выпуск релизов, автоматическое тестирование и деплой.",
          "Выполнял роль техлида, участвовал в формировании команды, определении архитектуры системы и планировании производственных процессов.",
          "Непосредственно участвовал в разработке, контролировал процессы разработки, проводил ревью кода и управлял выпуском релизов.",
          "Обеспечил своевременную поставку готового решения первой фазы на приёмочное тестирование для заказчиков."
        ]
      },
      {
        "position":"Ведущий программист",
        "company": "Интерфакс",
        "start-year": "2017",
        "start-month": "Февраль",
        "finish-year": "2021",
        "finish-month": "Июнь",
        "responsibilities": [
          "Работа над проектом по оценке качества госуслуг (vashkontrol.ru).",
          "Основательно реструктурировал унаследованный код, улучшив производительность и оптимизировав рабочие процессы для успешного решения проблем с продуктивностью.",
          "Разрабатывал архитектурные решения, контролировал важные технические решения и обучал младших разработчиков.",
          "Разработал библиотеки на Ruby, опубликованные в качестве open-source."
        ]
      },
      {
        "position": "Ведущий программист",
        "company": "Мед-Медиа",
        "start-year": "2010",
        "start-month": "Февраль",
        "finish-year": "2017",
        "finish-month": "Февраль",
        "responsibilities": [
          "Полный цикл разработки и поддержки сайтов медицинской тематики: medportal.ru, doktor.ru, mama.ru.",
          "Перезапуск medportal.ru сначала на PHP-фреймворке собственной разработки, затем на Ruby on Rails. В процессе работы данные переносились из MySQL в PostgreSQL с одновременной оптимизацией.",
          "Перезапуск doktor.ru сначала на PHP-фреймворке собственной разработки, затем на Ruby on Rails. Данные переносились из MySQL в PostgreSQL с параллельной оптимизацией.",
          "Перезапуск трёх сайтов в составе распределённой системы с использованием Ruby on Rails для backend и AngularJS для frontend."
        ]
      },
      {
        "position": "Ведущий программист",
        "company": "Максвелл Капитал",
        "start-year": "2006",
        "start-month": "Май",
        "finish-year": "2010",
        "finish-month": "Январь",
        "responsibilities": [
          "Руководство проектами: работа с заказчиком, разработка архитектуры, функционала, организация процесса разработки, реализация функционала, поддержка.",
          "Разработка интерактивной системы приёма документов онлайн от партнёров и филиалов с использованием электронной цифровой подписи. Платформа: ASP .NET (C#), MSSQL 2005.",
          "Разработка бэк-офис системы для инвестиционной компании. Платформа: Delphi, ASP .NET, MSSQL 2005.",
          "Разработка бэк-офис системы для управляющей компании. Платформа: .NET, Delphi, MSSQL 2005."
        ]
      },
      {
        "position": "Программист",
        "company": "Мобинетикс",
        "start-year": "2003",
        "start-month": "October",
        "finish-year": "2006",
        "finish-month": "May",
        "responsibilities": [
          "Участвовал в разработке и поддержке передовой системы отслеживания и мониторинга автомобилей (www.amicusvms.com).",
          "Проектирование, разработка, тестирование и отладка отказоустойчивых серверных приложений на C#.NET.",
          "Разработка отказоустойчивых приложений для мобильных устройств с использованием Java ME, осуществляющих сбор и передачу данных по беспроводным каналам связи GSM и GPRS.",
          "Интерфейс для записи и получения данных в СУБД.",
          "Резервный сервис управления устройствами по протоколу SMS."
        ]
      },
      {
        "position": "Программист",
        "company": "Инфолинк",
        "start-year": "1998",
        "start-month": "August",
        "finish-year": "2003",
        "finish-month": "August",
        "responsibilities": [
          "Разработка и поддержка корпоративного программного обеспечения для коммуникаций, включая системы оповещения, предоставление интернета и IP-телефонию.",
          "Адаптация программного обеспечения для оповещения (отправка беспроводных сообщений, биллинг, управление сетью) под нужды компании. Инструменты: Borland C++ Builder, Borland Delphi, Interbase.",
          "Проектирование и поддержка корпоративных веб-сайтов. Инструменты: PHP, Perl.",
          "Администрирование корпоративной сети и серверных компьютеров. Операционные системы: FreeBSD, Windows 2000 Server.",
          "Обучение персонала."
        ]
      },
      {
        "position": "Администратор баз данных",
        "company": "Мобил Телеком",
        "start-year": "1998",
        "start-month": "January",
        "finish-year": "1998",
        "finish-month": "June",
        "responsibilities": [
          "Администрирование баз данных, пейджингового оборудования и коммуникационного программного обеспечения."
        ]
      },
      {
        "position": "Лаборант",
        "company": "Чувашский Государственный Университет",
        "start-year": "1997",
        "start-month": "January",
        "finish-year": "1997",
        "finish-month": "June",
        "responsibilities": [
          "Обслуживание лабораторного оборудования, техническая поддержка."
        ]
      }
    ]
  }
}
